app/Models/AdherentModel.php

	function participer($idtontine){
		return 	$this->join("participer as p","p.idAdherant=adherent.id")
		->join("tontine as t","t.id=p.idTontine")
		->where("t.id",$idtontine)
		->findAll();
---
SELECT *
FROM `adherent`
JOIN `participer` as `p` ON `p`.`idAdherant`=`adherent`.`id`
JOIN `tontine` as `t` ON `t`.`id`=`p`.`idTontine`
WHERE `t`.`id` = '10'

function cotiser($idtontine){
	$cotis=$this->selectCount('adherent.id',"nbCotis")
	            ->select('adherent.id')
				->join("cotiser as c","c.idAdherant=adherent.id")
				->join("echeance as e","e.id=c.idEcheance")
				->where("e.idTontine",$idtontine)
				->groupBy('adherent.id')
				->get()->getResultArray();
---
SELECT COUNT(`adherent`.`id`) AS `nbCotis`, `adherent`.`id`
FROM `adherent`
JOIN `cotiser` as `c` ON `c`.`idAdherant`=`adherent`.`id`
JOIN `echeance` as `e` ON `e`.`id`=`c`.`idEcheance`
WHERE `e`.`idTontine` = '10'
GROUP BY `adherent`.`id`