app/Models/EcheanceModel.php

SELECT *
FROM `echeance`
WHERE `idTontine` = '10'
---
   function echeancesTontine($idtontine){
       return $this->where('idTontine',$idtontine)->findAll();

SELECT *
FROM `echeance`
JOIN `cotiser` as `c` ON `c`.`idEcheance`=`echeance`.`id`
WHERE `echeance`.`idTontine` = '10'
AND `c`.`idAdherant` = '7'
---
   function Noscotisation($idtontine){

       return $this->join("cotiser as c","c.idEcheance=echeance.id")
                    ->where("echeance.idTontine",$idtontine)
                   ->where("c.idAdherant",session()->get("id"))->findAll();;