app/Models/TontineModel.php

    function ListeTontineResp($idAdherent){
        return $this->where("idResponsable",$idAdherent)
                    ->findAll();
---
SELECT *
FROM `tontine`
WHERE `idResponsable` = '6'

    function tontine($idtontine){
        return $this->find($idtontine);
---
SELECT *
FROM `tontine`
WHERE `tontine`.`id` = '10'

    function tontineParticiper($idAdherent){
    return    $this->join("participer as p","p.idTontine=tontine.id")
                   ->where("p.idAdherant",$idAdherent)
                   ->findAll();
---
SELECT *
FROM `tontine`
JOIN `participer` as `p` ON `p`.`idTontine`=`tontine`.`id`
WHERE `p`.`idAdherant` = '6'